{"posts":[{"title":"基于 Alist 和 RaiDrive 挂载云盘到本地","text":"本文首先介绍了基于 Alist 进行多个云盘管理，然后介绍了基于 RaiDrive 挂载云盘到本地的过程，最后介绍了基于 PowerShell 脚本自动化挂载的操作。 Alist 管理多个云盘Alist文档 Alist 使用指南 第一步：安装本文介绍 Windows 系统下最新版 Alist 使用方法，其他系统请参考 Alist 文档。 Alist 手动安装 1234567# 下载 Alistunzip alist-xxxx.zip # 解压下载的文件，得到可执行文件# 第一次启用时需要设置密码，然后登录.\\alist.exe admin random # 随机生成密码.\\alist.exe admin set NEW_PASSWORD # # 手动设置一个密码 `NEW_PASSWORD`是指你需要设置的密码# 下次直接启用，使用设置的密码登录.\\alist.exe server # 启动 Alist 服务 安装完之后在浏览器登录：http://127.0.0.1:5244/@login. 第二步：添加云盘登录完成后点击底部 Manage/管理 按钮，进入管理界面。 从左侧的 Storages 导航进入添加云盘界面，添加自己的云盘，下面是一些需要注意的设置项： Driver: 选择云盘类型，这里选择 AliyunDriveOpen，即阿里云盘； Mount Path: 设置挂载路径，这里设置为 阿里云盘，即在 Alist 界面中显示的云盘名称； WebDAV policy: 设置 WebDAV 策略，这里选择 native proxy，即使用 Alist 自带的 WebDAV 代理； Refresh Token: 设置阿里云盘的 Refresh Token，这里使用 Alist 提供的工具 获取； Order by: 设置排序方式，这里选择 name，即按照名称排序； Order direction: 设置排序方向，这里选择 asc，即升序排列。 设置完成后启用服务然后登录即可以看到添加的云盘，点击云盘名称即可进入云盘。 Alist 使用指南：添加阿里云盘Open RaiDrive 挂载云盘到本地RaiDrive 官网 RaiDrive 说明文档 点击添加，选择 NAS 选项，然后选择 WebDAV； 进行如下设置：取消选择地址，设置地址和端口为 Alist 服务的地址和端口，这里是 http://127.0.0.1和5244，然后输入 Alist 设置的 admin 密码，点击确定即可。 PowerShell 脚本自动化挂载利用 PowerShell 脚本自动化挂载云盘到本地有两个理由： 由于每次关机之后 Alist 服务会停止，所以需要每次开机后手动启动 Alist 服务； RaiDrive 可以设置自动启动，但是会有广告弹窗，且自启动的方式不是我喜欢的模式。 123456Set-Location -Path &quot;Path to alist.exe&quot; # need to change directory to where the alist.exe is locatedWrite-Host &quot;Current directory is: $pwd&quot;Write-Host &quot;Launch RaiDrive...&quot;Start-Process -FilePath &quot;Path to RaiDrive.exe&quot; # need to change directory to where the RaiDrive.exe is locatedWrite-Host &quot;Launch Alist server...&quot;.\\alist.exe server 将以上代码保存为 alist.ps1，并将其路径添加到 PowerShell $PROFILE 中，即可以在 Terminal 中自动化挂载。","link":"/e24cbdc907f5/"},{"title":"深度学习概念梳理","text":"本文介绍了深度学习中的一些概念，包括人工智能、机器学习、人工神经网络、深度学习、数据挖掘等，以及它们之间的相互关系。 人工智能人工智能 Artificial Intelligence Artificial Intelligence -IBM 人工智能（英语：artificial intelligence，缩写为 AI）亦称智械、机器智能，指由人制造出来的机器所表现出来的智能。通常人工智能是指通过普通计算机程序来呈现人类智能的技术。该词也指出研究这样的智能系统是否能够實現，以及如何實現。同时，通过医学、神经科学、机器人学及统计学等的进步，常态预测则认为人类的很多职业也逐渐被其取代。 人工智能于一般教材中的定义领域是“智能主体（intelligent agent）的研究与设计”，智能主体指一个可以观察周遭环境并作出行动以达致目标的系统。约翰·麦卡锡于 1954 年的定义是“制造智能机器的科学与工程”。安德烈亚斯·卡普兰（Andreas Kaplan）和迈克尔·海恩莱因（Michael Haenlein）将人工智能定义为“系统正确解释外部数据，从这些数据中学习，并利用这些知识通过灵活适应实现特定目标和任务的能力”。 机器学习机器学习 Machine Learning Machine Learning -IBM 机器学习是人工智能的一个分支。人工智能的研究历史有着一条从以“推理”为重点，到以“知识”为重点，再到以“学习”为重点的自然、清晰的脉络。显然，机器学习是实现人工智能的一个途径，即以机器学习为手段解决人工智能中的问题。机器学习在近 29 多年已发展为一门多领域交叉学科，涉及概率论、统计学、逼近论、凸分析、计算复杂性理论等多门学科。机器学习理论主要是设计和分析一些让计算机可以自动“学习”的算法。机器学习算法是一类从数据中自动分析获得规律，并利用规律对未知数据进行预测的算法。因为学习算法中涉及了大量的统计学理论，机器学习与推断统计学联系尤为密切，也被称为统计学习理论。算法设计方面，机器学习理论关注可以实现的，行之有效的学习算法。很多推论问题属于无程序可循难度，所以部分的机器学习研究是开发容易处理的近似算法。 机器学习已广泛应用于数据挖掘、计算机视觉、自然语言处理、生物特征识别、搜索引擎、医学诊断、检测信用卡欺诈、证券市场分析、DNA 序列测序、语音和手写识别、战略游戏和机器人等领域。 人工神经网络人工神经网络 Artificial Neural Network 人工神经网络（英语：Artificial Neural Network，ANN），简称神经网络（Neural Network，NN）或人工神經网络，在机器学习和认知科学领域，是一种模仿生物神经网络（动物的中枢神经系统，特别是大脑）的结构和功能的数学模型或计算模型，用于对函数进行估计或近似。神经网络由大量的人工神经元联结进行计算。大多数情况下人工神经网络能在外界信息的基础上改变内部结构，是一种自适应系统，通俗地讲就是具备学习功能。现代神经网络是一种非线性统计性数据建模工具，神经网络通常是通过一个基于数学统计学类型的学习方法（Learning Method）得以优化，所以也是数学统计学方法的一种实际应用，通过统计学的标准数学方法我们能够得到大量的可以用函数来表达的局部结构空间，另一方面在人工智能学的人工感知领域，我们通过数学统计学的应用可以来做人工感知方面的决定问题（也就是说通过统计学的方法，人工神经网络能够类似人一样具有简单的决定能力和简单的判断能力），这种方法比起正式的逻辑学推理演算更具有优势。 和其他机器学习方法一样，神经网络已经被用于解决各种各样的问题，例如机器视觉和语音识别。这些问题都是很难被传统基于规则的编程所解决的。 深度学习深度学习 Deep Learning Deep Learning -IBM 深度学习（英语：deep learning）是机器学习的分支，是一种以人工神經网络为架构，对资料进行表征学习的算法。 深度学习是机器学习中一种基于对数据进行表征学习的算法。观测值（例如一幅图像）可以使用多种方式来表示，如每个像素强度值的向量，或者更抽象地表示成一系列边、特定形状的区域等。而使用某些特定的表示方法更容易从实例中学习任务（例如，人脸识别或面部表情识别）。深度学习的好处是用非监督式或半监督式的特征学习和分层特征提取高效算法来替代手工获取特征。 表征学习的目标是寻求更好的表示方法并创建更好的模型来从大规模未标记数据中学习这些表示方法。表示方法来自神经科学，并松散地创建在类似神经系统中的信息处理和对通信模式的理解上，如神经编码，试图定义拉动神经元的反应之间的关系以及大脑中的神经元的电活动之间的关系。 至今已有数种深度学习框架，如深度神经网络、卷积神经网络和深度置信网络和循环神经网络已被应用在计算机视觉、语音识别、自然语言处理、音频识别与生物信息学等领域并获取了极好的效果。 另外，“深度学习”已成为时髦术语，或者说是人工神经网络的品牌重塑。 数据挖掘 Data Mining 数据挖掘（英语：data mining）是一个跨学科的计算机科学分支。它是用人工智能、机器学习、统计学和数据库的交叉方法在相对较大型的数据集中发现模式的计算过程。 数据挖掘过程的总体目标是从一个数据集中提取信息，并将其转换成可理解的结构，以进一步使用。除了原始分析步骤，它还涉及到数据库和数据管理方面、数据预处理、模型与推断方面考量、兴趣度度量、复杂度的考虑，以及发现结构、可视化及在线更新等后处理。数据挖掘是“数据库知识发现”（Knowledge-Discovery in Databases, KDD）的分析步骤，本质上属于机器学习的范畴。 相互关系What’s The Difference Between AI, Machine Learning, and Deep Learning?AI means getting a computer to mimic human behavior in some way. Machine learning is a subset of AI, and it consists of the techniques that enable computers to figure things out from the data and deliver AI applications. Deep learning, meanwhile, is a subset of machine learning that enables computers to solve more complex problems. What’s the Difference Between AI, Machine Learning, and Deep Learning? AI vs. Machine Learning vs. Deep Learning vs. Neural Networks: What’s the Difference?Perhaps the easiest way to think about artificial intelligence, machine learning, neural networks, and deep learning is to think of them like Russian nesting dolls. Each is essentially a component of the prior term. AI vs. Machine Learning vs. Deep Learning vs. Neural Networks: A easy way for differentiation | Kaggle Artificial Intelligence That is, machine learning is a subfield of artificial intelligence. Deep learning is a subfield of machine learning, and neural networks make up the backbone of deep learning algorithms. In fact, it is the number of node layers, or depth, of neural networks that distinguishes a single neural network from a deep learning algorithm, which must have more than three. AI vs. Machine Learning vs. Deep Learning vs. Neural Networks: What’s the Difference? Data Mining Vs. Machine Learning: What Is the Difference?What is Data Mining? Data mining is considered the process of extracting useful information from a vast amount of data. It’s used to discover new, accurate, and useful patterns in the data, looking for meaning and relevant information for the organization or individual who needs it. It’s a tool used by humans. What is Machine Learning? On the other hand, machine learning is the process of discovering algorithms that have improved courtesy of experience derived from data. It’s the design, study, and development of algorithms that permit machines to learn without human intervention. It’s a tool to make machines smarter, eliminating the human element (but not eliminating humans themselves; that would be wrong). Difference Between Data mining and Machine learning: Data mining is the subset of business analytics, it is similar to experimental research. The origins of data mining are databases, statistics. Whereas machine learning involves the algorithm that improves automatically through experience based on data. Data Mining Vs. Machine Learning: What Is the Difference? Data Mining vs Machine Learning What’s More?The main difference between regression and a neural network is the impact of change on a single weight. In regression, you can change a weight without affecting the other inputs in a function. However, this isn’t the case with neural networks. Since the output of one layer is passed into the next layer of the network, a single change can have a cascading effect on the other neurons in the network.","link":"/dfe1e736e68f/"},{"title":"基于 Hexo 和 GitHub 搭建个人博客","text":"本文首先介绍了 Hexo 的安装， 然后介绍了 GitHub Pages 的设置，最后介绍了一些主题自定义的内容。 Hexo 安装Hexo 官网 Hexo 说明文档 前置条件 安装 Node.js 并了解 npm 相关基础知识； 安装 git 并了解其基本使用方法。 安装 Hexo12345npm install hexo-cli -g # 安装 Hexohexo init blog # blog 为博客项目根目录cd blognpm installhexo server # 启动服务 GitHub Pages 设置GitHub Pages | Hexo GitHub SSH 连接配置好 SSH 连接后，就可以使用 SSH 协议来连接 GitHub。 新建 GitHub Repo创建仓库新建一个名为 username.github.io 的仓库，最后博客的访问地址就是 http://username.github.io. 修改 config 文件中的 deploy 方式这里采用 Hexo 说明文档中的 One-command Deployment 方式，即一键部署，需要修改 _config.yml 文件中的 deploy 部分和安装 hexo-deployer-git 插件。 1234deploy: type: git repository: git@github.com: username/username.github.io.git branch: main 1npm install hexo-deployer-git –save 博客撰写与发布 新建文章 12hexo new post &quot;about&quot; # 新建关于页面hexo new &quot;My New Post&quot; # 新建文章 生成静态文件 1hexo generate 发布 1hexo deploy 添加多个标签： 123tags: - tag 1 - tag 2 添加分类： 123categories: - category 1 - category 2 添加目录： 1toc: true # 在文章中添加目录 主题自定义主页三栏、文章页两栏新建一个_config.post.yml文件，内容如下： ~\\blog\\_config.post.yml123456789101112131415161718192021222324252627282930313233widgets: # Archives widget configurations - # Where should the widget be placed, left sidebar or right sidebar position: right type: archives # Categories widget configurations - # Where should the widget be placed, left sidebar or right sidebar position: right type: categories # Tags widget configurations - # Where should the widget be placed, left sidebar or right sidebar position: right type: tags # How to order tags. For example 'name' to order by name in ascending order, and '-length' to order by number of posts in each tags in descending order order_by: name # Amount of tags to show. Will show all if not set. amount: # Whether to show tags count, i.e. number of posts in the tag. show_count: true # Table of contents widget configurations - # Where should the widget be placed, left sidebar or right sidebar position: right type: toc # Whether to show the index of each heading index: false # Whether to collapse sub-headings when they are out-of-view collapsed: false # Maximum level of headings to show (1-6) depth: 4 调整两栏的宽度： 在 layout.jsx 中作如下修改：强制双栏显示的页面宽度为三栏的宽度，即 is-3-column。 ~\\blog\\node_modules\\hexo-theme-icarus\\layout\\layout.jsx1234 &lt;Head site={site} config={config} helper={helper} page={page} /&gt;- &lt;body class={`is-${columnCount}-column`}&gt;+ &lt;body class={`is-3-column`}&gt; &lt;Navbar config={config} helper={helper} page={page} /&gt; 然后在 layout.jsx 和 widgets.jsx 中修改 columnCount 的值，需要保证二者之和为 12。 ~\\blog\\node_modules\\hexo-theme-icarus\\layout\\layout.jsx1234 'is-12': columnCount === 1,- 'is-8-tablet is-8-desktop is-8-widescreen': columnCount === 2,+ 'is-8-tablet is-8-desktop is-9-widescreen': columnCount === 2, 'is-8-tablet is-8-desktop is-6-widescreen': columnCount === 3 ~\\blog\\node_modules\\hexo-theme-icarus\\layout\\common\\widgets.jsx12345678 function getColumnSizeClass(columnCount) { switch (columnCount) { case 2:- return 'is-4-tablet is-4-desktop is-4-widescreen';+ return 'is-4-tablet is-4-desktop is-3-widescreen'; case 3: return 'is-4-tablet is-4-desktop is-3-widescreen'; } 目录粘性定位在 main.js 中添加如下一行： ~\\blog\\node_modules\\hexo-theme-icarus\\source\\js\\main.js123 if ($toc.length &gt; 0) {+ $toc.addClass('column-right is-sticky'); # 和自己的 widget 的位置对应 const $mask = $('&lt;div&gt;'); 在 widget.styl 中添加如几行： ~\\blog\\node_modules\\hexo-theme-icarus\\include\\style\\widget.styl123+#toc+ max-height: calc(100vh - 22px)+ overflow-y: scroll 所有图片居中显示在 article.styl 中添加如下四行： ~\\blog\\node_modules\\hexo-theme-icarus\\include\\style\\article.styl1234567 footer strong + cite margin-left: .5em+ a+ img+ margin: auto+ display: block Footer 高度修改新建一个自定义的 style 文件，内容如下： ~\\blog\\node_modules\\hexo-theme-icarus\\include\\style\\custom.styl123.footer background-color rgba(255,255,255,0.7) padding 1.5rem 1.5rem 1.5rem 在 style.styl 中引入： ~\\blog\\node_modules\\hexo-theme-icarus\\source\\css\\style.styl12 @import '../../include/style/responsive'+ @import '../../include/style/ZSY_custom' Icarus 主题自定义 主题说明文档-常见问题","link":"/97a0e81144b5/"}],"tags":[{"name":"Alist","slug":"Alist","link":"/tags/Alist/"},{"name":"RaiDrive","slug":"RaiDrive","link":"/tags/RaiDrive/"},{"name":"PowerShell","slug":"PowerShell","link":"/tags/PowerShell/"},{"name":"MachineLearning","slug":"MachineLearning","link":"/tags/MachineLearning/"},{"name":"DeepLearning","slug":"DeepLearning","link":"/tags/DeepLearning/"},{"name":"Blog","slug":"Blog","link":"/tags/Blog/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"GitHub","slug":"GitHub","link":"/tags/GitHub/"}],"categories":[{"name":"经验积累-软件使用","slug":"经验积累-软件使用","link":"/categories/%E7%BB%8F%E9%AA%8C%E7%A7%AF%E7%B4%AF-%E8%BD%AF%E4%BB%B6%E4%BD%BF%E7%94%A8/"},{"name":"知识学习-深度学习","slug":"知识学习-深度学习","link":"/categories/%E7%9F%A5%E8%AF%86%E5%AD%A6%E4%B9%A0-%E6%B7%B1%E5%BA%A6%E5%AD%A6%E4%B9%A0/"},{"name":"经验积累-个人博客","slug":"经验积累-个人博客","link":"/categories/%E7%BB%8F%E9%AA%8C%E7%A7%AF%E7%B4%AF-%E4%B8%AA%E4%BA%BA%E5%8D%9A%E5%AE%A2/"}],"pages":[{"title":"学术索引","text":"Academic Search Engines Google Scholar arXiv ResearchGate Sci-Hub Search Engine Publisher ACM Digital Library ACM ASME Digital Collection ASME Elsevier ScienceDirect Elsevier IEEE Xplore IEEE Nature Search Springer Nature Oxford Academic Oxford University Press PNAS National Academy of Sciences Science AAAS SpringerLink Springer Nature Springer Nature Showcase Springer Nature Taylor &amp; Francis Online Taylor &amp; Francis Wiley Online Library Wiley Elsevier Journals Journal Impact Factor Artificial Intelligence 14.4 Automatica 6.4 Computer Methods in Applied Mechanics and Engineering 7.2 Computers &amp; Structures 4.7 Computers in Industry 10 ISA Transactions 7.3 Journal of Computational and Applied Mathematics 2.4 Journal of Computational Physics 4.1 Journal of Sound and Vibration 4.7 Mechanical Systems and Signal Processing 8.4 Measurement 5.6 IEEE Journals Journal Impact Factor IEEE Sensors Journal 4.3 IEEE Transactions on Automatic Control 6.8 IEEE Transactions on Industrial Electronics 7.7 IEEE Transactions on Industrial Informatics 12.3 IEEE Transactions on Instrumentation and Measurement 5.6 IEEE Transactions on Neural Networks and Learning Systems 10.4 IEEE Transactions on Pattern Analysis and Machine Intelligence 23.6 Other Journals Publisher Journal Impact Factor AAAS Science Advances 13.6 Nature Communications Physics 5.5 Nature Nature Communications 16.6 Nature Nature Machine Intelligence 23.8 Springer International Journal of Computer Vision (IJCV) 19.5 Wiley Advanced Science 15.1 Journal Abbreviation Search CAS Source Index (CASSI) Search Tool Web of Science Help (webofknowledge.com) Science and Engineering Journal Abbreviations | Woodward Library (ubc.ca) Journal Abbreviation Database (library.illinois.edu) Conferences Publisher Conference Neural Information Processing Systems Foundation Neural Information Processing Systems (NeurIPS) International Machine Learning Society International Conference on Machine Learning (ICML) ICLR Foundation International Conference on Learning Representations (ICLR) IEEE International Conference on Computer Vision (ICCV)","link":"/academic-index/index.html"},{"title":"官方文档","text":"官方文档 Official Document Official Document Python Docs C# Docs TensorFlow Docs PyTorch Docs JAX Docs Keras Docs WSL Docs .NET Docs PowerShell Docs Windows Terminal Docs Visual Studio Docs VS Code Docs Git Docs GitHub Docs Markdown Docs LaTeX Docs HTML Docs CSS Docs 编程语言 Language Language List of programming languages TIOBE Index Python Matlab C++ C# Java JavaScript TypeScript Rust","link":"/official-documentations/index.html"},{"title":"在线资源","text":"在线书籍 Online Books Description Deep Learning (deeplearningbook.org) Deep Learning Book Dive into Deep Learning — Dive into Deep Learning 1.0.0-beta0 documentation (d2l.ai) Dive into Deep Learning Neural networks and deep learning Neural networks and deep learning Introduction to Probability for Data Science (probability4datascience.com) Introduction to Probability for Data Science 简单粗暴 TensorFlow 2 简单粗暴 TensorFlow 2 神经网络与深度学习 (nndl.github.io) 神经网络与深度学习 动手学深度学习 动手学深度学习 在线课程 Online Courses Description ECE 595 / STAT 598: Machine Learning Purdue - Machine Learning CS230 Deep Learning (stanford.edu) Stanford - Deep Learning CSC321 Neural Networks and Machine Learning) Toronto - Neural Networks and Machine Learning Unsupervised Feature Learning and Deep Learning Tutorial Stanford - Unsupervised Feature Learning and Deep Learning Tutorial Analysis and Design of Feedback Control Systems MIT Analysis and Design of Feedback Control Systems ME 564 - Mechanical Engineering Analysis (washington.edu) Washington - Meachanical Engineering Analysis Math 207A, Fall 2014 (ucdavis.edu) Applied Mathematics Vibrationdata Matlab Page Vibration data Matlab Linear Algebra M408M Learning Modules (utexas.edu) Multivariable Calculus DEEP LEARNING · Deep Learning (atcold.github.io) Deep Learning with PyTorch 深度学习教程中文版 Deep learning tutorial in Chinese/深度学习教程中文版 CS 自学指南 CS 自学指南 AI 算法工程时手册 AI 算法工程师手册 在线学习社区 Online Learning Community Description Machine Learning Tutorial (geeksforgeeks.org) Machine Learning Tutorial Deep Learning Tutorial - GeeksforGeeks Deep Learning Tutorial Deep Learning - NVIDIA Developer Deep Learning GeeksforGeeks GeeksforGeeks freeCodeCamp Free Code Camp LeetCode LeetCode - The World’s Leading Online Programming Learning Platform 资源网站 Website Website 易搜-网盘资源搜索 黑洞导航 Alist-七米蓝 Alist-微资源 熊猫无损音乐 KK 小站-夸克网盘资源 网盘小站-阿里云盘资源","link":"/online-resources/index.html"}]}